#Задача 43. Количеството (в кг) кашкавал, което се изразходва в дадена пицария за една
#седмица, е нормално разпределено с параметри 𝜇 = 41, 𝜎 = 5.

#а) Каква е вероятността в произволно избрана седмица пицарията да изразходи над 51
#кг кашкавал?

#P(X>51)=1-P(X<=51)
1-pnorm(51,41,5)

#б) Каква е вероятността в произволно избрана седмица пицарията да изразходи между
#45 и 50 кг кашкавал?

#P(45<X<50)=P(X<50)-P(X<45)
pnorm(50,41,5)-pnorm(45,41,5)

#в) Колко кашкавал трябва да има в запас в дадена седмица, така че да е достатъчно с
#вероятност 0.99?

#t=? P(X<= t)=0.99
qnorm(0.99,41,5)
