#Задача 42. Времето (в години) до повреда на пералня от даден модел е случайна величина 𝑋, която има експоненциално разпределение с параметър 𝜆 = 1/4.

#а) Намерете вероятността пералня от този модел да не се повреди през първите 3 години.
#P(X>3)=1-P(X<=3)

1-pexp(3,1/4)

#б) Намерете вероятността пералня от този модел да се повреди през първите 2 години.
#P(X<=2)

pexp(2,1/4)

#в) Ако пералня е работила без повреда 3 години, каква е вероятността да работи без
#повреда още 3 години?
#P(X>6 | X>3)=P(X>6) / P(X>3) oznachava da raboti 6 godini ot nachaloto .Go zapisvame kato uslovna veroqtnost

(1-pexp(6,1/4))/(1-pexp(3,1/4))

#г) Намерете 𝑡, за което P(𝑋 ≤ 𝑡) = 0.90.
#t=? P(𝑋 ≤ 𝑡) = 0.90

qexp(0.9,1/4)
pexp(9.21034,1/4)  
