Авиокомпания е продала 143 билета за самолет, в който има 138 пътнически
места. Вероятността пътник да дойде навреме за полета си е 0.92. Нека приемем, че даден
пътник идва навреме независимо от останалите пътниците.
а) Каква е вероятността да има място за всички пътници, които са дошли навреме?
б) Каква е вероятността да остане едно незаето пътническо място?

sim.airplane <-function(){
x <- sample ( c(0,1),143,replace=T,prob=c ( 0.08,0.92))
sum(x)
}
sim.airplane()
res <- replicate(100000,sim.airplane())
#a)
sum(res<=138)/length(res)
#b)
sum(res==137)/length(res)
