 #Задача 41. Количеството (в мл) на портокалов сок в случайно избрана бутилка, 
 #произведена от дадена компания, е случайна величина, която има равномерно разпределение в
 #интервала (495, 502).
#а) Намерете вероятността в случайно избрана бутилка да има повече от 500 мл сок.
#б) Нека 𝑣 e такова, че с вероятност 0.8 в случайно избрана бутилка има поне 𝑣 мл сок.
#Намерете стойността на v

#a)
#P(X>500)=1-P(X<=500)
1-punif(500,495,502)

#b)
#v=? P(X>V)=0.8
#P(X<=v)=0.2
qunif(0.2,495,502)
punif(496.4,495,502) # rezultata shte e 0.2
