#Авиокомпания е продала 143 билета за самолет, в който има 138 пътнически
#места. Вероятността пътник да дойде навреме за полета си е 0.92. Нека приемем, че даден
#пътник идва навреме независимо от останалите пътниците.

# има 143 опита 
#Х= брой пътници който идват на време
#X ~ Bi(n=143,p=0.92)

#а) Каква е вероятността да има място за всички пътници, които са дошли навреме?
#P(X<=138)

pbinom(138,143,0.92)

#б) Каква е вероятността да остане едно незаето пътническо място?
#tyi kato mestata sa 138 tova oznachava da dojdat tochno 137 
#P(X=137)
dbinom(137,143,0.92)
