На всеки от върховете на равностранен триъгълник има една мравка. Всяка
мравка избира произволно един от другите два върха и тръгва към него. За единица време
всяка мравка изминава разстоянието от един връх до друг. Две мравки могат да се разминат
ако тръгнат една срещу друга. Каква е вероятността след единица време да има по една
мравка на всеки връх?

sim.ants <- function() {
a1<-sample(c(2,3),1)
a2<-sample(c(1,3),1)
a3<-sample(c(1,2),1)
a<-c(a1,a2,a3)
a
#any(duplicated(a))==F
unique(a)
length(unique(a))==3
}

sim.ants()
res <- replicate(1000000,sim.ants())
sum(res)/length(res)
