#Задача 37. За 𝑛 = 200 и 𝑛 = 1000 генерирайте данни 𝑥1, 𝑥2, . . . , 𝑥𝑛 от нормално
#разпределение с параметри 𝜇 = 4, 𝜎 = 1.2. Начертайте емпиричната функция на разпределение на
#данните. На същата картинка добавете функцията на разпределение на случайна величина
#𝑋 ∼ 𝒩 (𝜇 = 4, 𝜎 = 1.2).

 x1 <-rnorm(200,4,1.2)
 plot.ecdf(x1,do.points=F,lwd=2)
 curve(pnorm(x,4,1.2),add=T,col="red",lwd=2)

#pri n=1000
 x1 <-rnorm(1000,4,1.2)
 plot.ecdf(x1,do.points=F,lwd=2)
 curve(pnorm(x,4,1.2),add=T,col="red",lwd=2)
