#Задача 55. (Данни survey от пакета MASS .) Намерете медианата, средната стойност и
#стандартното отклонение на:
#а) пулса на студентите;

my.summary(Pulse)

#б) пулса на жените;

my.summary(Pulse[Sex=="Female"])

#в) пулса на студентите на възраст не повече от 25 години;
my.summary(Pulse[Age<=25])

#г) пулса на студентите, правещи физически упражнения често;

my.summary(Pulse[Exer=="Freq"])

#д) пулса на студентите, които са непушачи и правят физически упражнения често

my.summary(Pulse[Exer=="Freq" & Smoke=="Never" ])
