В една кутия има 2 зелени и 2 червени топки. В друга кутия има 1 зелена и
4 червени топки. Хвърляме зар и ако се падне шестица, теглим топка от първата кутия, а
ако не се падне шестица, теглим топка от втората кутия.
а) Каква е вероятността да извадим зелена топка?
б) Ако извадената топка е зелена, каква е вероятността да е извадена от втората кутия?

sim.dice.ball.a <- fucntion(){
dice <- sample(c(1:6),1)
if(dice==6)
{
  ball <-sample(c("g","g","r","r"),1)
  }else{
  ball <-sample(c("g","r","r","r"),1)
  }
ball=="g"
}

res <-replicate(100000,sim.dice.ball.a( ))
sum(res)/length(res)
