На студенти е даден тест от 10 въпроса, всеки с по 4 възможни отговора, един
от които е верен. Иван се явява на теста без да е учил и огражда произволно отговори.
Каква е вероятността да е отговорил вярно на поне 5 от въпросите?

sim.test.ans <-function(){
x <- sample(c(0,0,0,1),10,replace=T)
sum(x)>=5
}
res <-replicate(100000,sim.test.ans())
sum(res)/length(res)

sim.test.ans1<-function()
{
  x<-sample(c(0,1),10,replace=T,prob=c(0.75,0.25))
  sum(x)>=5
}
res <-replicate(100000,sim.test.ans1())
sum(res)/length(res)


Tук се симулират 10 въпроса, всеки с 4 възможни отговора:

1 означава „вярен отговор“

0 означава „грешен отговор“

Функцията sample() избира на случаен принцип между 0 и 1, 10 пъти, като:

replace = T → изборът е с връщане, т.е. всеки въпрос е независим от предишните;

prob = c(0.75, 0.25) → вероятността за 0 е 0.75 (3 грешни отговора от 4),
а вероятността за 1 е 0.25 (1 верен от 4).
