
#Батерия, произведена в даден завод, е дефектна с вероятност 0.03. Случайно
#избрани батерии се взети за проверка.

#а) Каква е вероятността да се проверят не повече от 10 батерии докато се открие първата
#дефектна?

#Х =брой проверени батерии до откриване на 1та дефектна
#X~ Ge(p=0.03)
#P(x<=10)

pgeom(10-1,0.03)

#б) Каква е вероятността измежду първите 50 проверени батерии да има поне 2 дефектни?
#tova shte ima binomno razpredelenie
#Х =брой дефектни батерри измежду 50 проверени
#X~Bi(n=50,p=0.03)
#P(X>=2)=1-P(X<=1)

1-pbinom(1,50,0.03)
